#include <stdio.h>

int main()
{
	//创建二维数组
	//int arr[3][4];

	//初始化 - 创建的同时给赋值
	//int arr[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };
	//int arr[3][4] = { 1,2,3,4,5,6,7 };  //不完全初始化 - 后面补0
	//int arr[3][4] = { {1,2}, {3,4}, {5,6} };
	int arr[][4] = { {1,2}, {3,4}, {5,6} };

	int i = 0;
	int j = 0;

	//for (i = 0; i < 3; i++)
	//{
	//	for (j = 0; j < 4; j++)
	//	{
	//		printf("[%d] ", arr[i][j]);
	//	}
	//	printf("\n");
	//}

	//证明了二维数组也是连续存放的
	//for (i = 0; i < 3; i++)
	//{
	//	for (j = 0; j < 4; j++)
	//	{
	//		printf("arr[%d][%d] = %p\n", i, j, &arr[i][j]);
	//	}
	//}

	int* p = &arr[0][0];  //取到第一个元素的地址
	for (i = 0; i < 12; i++)
	{
		printf("%d ", *p);
		p++;
	}
		 
	return 0;
}